_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 300)               0         
_________________________________________________________________
reshape_1 (Reshape)          (None, 300, 1)            0         
_________________________________________________________________
conv1d_1 (Conv1D)            (None, 299, 32)           96        
_________________________________________________________________
batch_normalization_1 (Batch (None, 299, 32)           128       
_________________________________________________________________
activation_1 (Activation)    (None, 299, 32)           0         
_________________________________________________________________
conv1d_2 (Conv1D)            (None, 298, 16)           1040      
_________________________________________________________________
batch_normalization_2 (Batch (None, 298, 16)           64        
_________________________________________________________________
activation_2 (Activation)    (None, 298, 16)           0         
_________________________________________________________________
conv1d_3 (Conv1D)            (None, 297, 8)            264       
_________________________________________________________________
batch_normalization_3 (Batch (None, 297, 8)            32        
_________________________________________________________________
activation_3 (Activation)    (None, 297, 8)            0         
_________________________________________________________________
conv1d_4 (Conv1D)            (None, 296, 4)            68        
_________________________________________________________________
batch_normalization_4 (Batch (None, 296, 4)            16        
_________________________________________________________________
activation_4 (Activation)    (None, 296, 4)            0         
_________________________________________________________________
max_pooling1d_1 (MaxPooling1 (None, 74, 4)             0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 296)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 50)                14850     
_________________________________________________________________
dropout_1 (Dropout)          (None, 50)                0         
_________________________________________________________________
batch_normalization_5 (Batch (None, 50)                200       
_________________________________________________________________
dense_2 (Dense)              (None, 20)                1020      
_________________________________________________________________
dropout_2 (Dropout)          (None, 20)                0         
_________________________________________________________________
dense_3 (Dense)              (None, 10)                210       
_________________________________________________________________
dropout_3 (Dropout)          (None, 10)                0         
_________________________________________________________________
dense_4 (Dense)              (None, 4)                 44        
=================================================================
Total params: 18,032
Trainable params: 17,812
Non-trainable params: 220
_________________________________________________________________
