_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
Input_1 (InputLayer)         (None, 300)               0         
_________________________________________________________________
Reshape_1 (Reshape)          (None, 300, 1)            0         
_________________________________________________________________
Convolution1D_1 (Conv1D)     (None, 299, 16)           48        
_________________________________________________________________
BatchNormalization_46 (Batch (None, 299, 16)           64        
_________________________________________________________________
Activation_1 (Activation)    (None, 299, 16)           0         
_________________________________________________________________
Convolution1D_7 (Conv1D)     (None, 298, 8)            264       
_________________________________________________________________
BatchNormalization_14 (Batch (None, 298, 8)            32        
_________________________________________________________________
Activation_7 (Activation)    (None, 298, 8)            0         
_________________________________________________________________
MaxPooling1D_3 (MaxPooling1D (None, 149, 8)            0         
_________________________________________________________________
Flatten_3 (Flatten)          (None, 1192)              0         
_________________________________________________________________
Dense_16 (Dense)             (None, 1000)              1193000   
_________________________________________________________________
Dropout_12 (Dropout)         (None, 1000)              0         
_________________________________________________________________
Dense_150 (Dense)            (None, 500)               500500    
_________________________________________________________________
Dropout_105 (Dropout)        (None, 500)               0         
_________________________________________________________________
Dense_17 (Dense)             (None, 100)               50100     
_________________________________________________________________
Dropout_13 (Dropout)         (None, 100)               0         
_________________________________________________________________
Dense_18 (Dense)             (None, 4)                 404       
=================================================================
Total params: 1,744,412
Trainable params: 1,744,364
Non-trainable params: 48
_________________________________________________________________
